## Introduction to Pandas

#### **Name:** Adiel Nefthali Delgado Silva

#### Import Pandas

In [1]:
import pandas as pd

#### Creating Series

In [2]:
s = pd.Series([10, 20, 30], index=["a","b","c"])
s

a    10
b    20
c    30
dtype: int64

In [3]:
data = {"Name": ['Alice', 'George'], "Age": [25,23]}
data

{'Name': ['Alice', 'George'], 'Age': [25, 23]}

In [4]:
df = pd.DataFrame(data)
df

     Name  Age
0   Alice   25
1  George   23

#### Viewing Data

In [ ]:
df.head(1)
#Si colocamos el 0 en donde va el 1 nos muestra los primeros 5 datos

    Name  Age
0  Alice   25

In [8]:
df.tail(1)

     Name  Age
1  George   23

#### Describe data

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    2 non-null      object
 1   Age     2 non-null      int64
dtypes: int64(1), object(1)
memory usage: 164.0+ bytes

In [ ]:
df.describe()
#Es lo del BoxPlot

             Age
count   2.000000
mean   24.000000
std     1.414214
min    23.000000
25%    23.500000
50%    24.000000
75%    24.500000
max    25.000000

#### Filtering Data

In [12]:
df[["Age","Name"]]

   Age    Name
0   25   Alice
1   23  George

In [ ]:
df[df["Age"]>24]
#Esto nos mostrara los valosres mayores a 24 segun Age

    Name  Age
0  Alice   25

#### Dataframe Indexing

In [ ]:
df.iloc[0]
#Fila de localizacion 0

Name    Alice
Age        25
Name: 0, dtype: object

In [16]:
df.iloc[:,0]
#[Fila y Columna]

0     Alice
1    George
Name: Name, dtype: object

In [ ]:
#df.loc[1]

Name    George
Age         23
Name: 1, dtype: object

#### Loading a Dataset
![image.png](iris_species.png)

In [18]:
df = pd.read_csv('iris.csv')

#### Exploring the dataset

In [20]:
df.columns
#Muestra las columnas del DataSet

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [ ]:
df.head()
#Por default nos da los primeros 5 valores

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
df.tail()
#Ultimos 5 valores

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [ ]:
df.describe()
#Si nos basamos en el valor de mayor desviacion estandar
#Es lo que nos va a ayudar a indentificar y clasificar
#Lo que tenemos en el dataset

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [ ]:
df['species'].value_counts()
#Cuenta el numero de datos que se tienen de cada "species"

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [30]:
df["sepal_length"], "species"

(0      5.1
 1      4.9
 2      4.7
 3      4.6
 4      5.0
       ...
 145    6.7
 146    6.3
 147    6.5
 148    6.2
 149    5.9
 Name: sepal_length, Length: 150, dtype: float64,
 'species')

In [33]:
df[(df['sepal_length']>5.5)&(df['species'] == 'setosa')]

    sepal_length  sepal_width  petal_length  petal_width species
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
18           5.7          3.8           1.7          0.3  setosa